/* App */
"app.name" = "Synca";
"app.slogan" = "灵感记录 即刻同步";

/* Login */
"login.sign_in_with_apple" = "通过 Apple 登录";
"login.failed" = "登录失败";
"login.failed_message" = "请稍后重试";
"auth.missing_credentials" = "无法获取 Apple 登录凭证";

/* Common */
"common.ok" = "好的";
"common.cancel" = "取消";
"common.delete" = "删除";
"common.copy" = "拷贝";
"common.save" = "保存";
"common.done" = "完成";
"common.all" = "全部";
"message.date.yesterday" = "昨天 %@";

/* Message List */
"message_list.todo_section" = "待整理";
"message_list.sync_success" = "同步成功";
"message_list.sync_failed" = "同步失败";
"message_list.error_too_long" = "消息不能超过 %d 个字符。";
"message_list.loading" = "加载中...";
"message_list.clear_all_confirm_title" = "确认删除";
"message_list.clear_all_confirm_message" = "将删除所有已完成的待办";
"message_list.clear_completed_all_categories" = "将删除所有分类中的已完成事项。";
"message_list.clear_completed_category_format" = "将删除“%@”中的已完成事项。";
"message_list.clear_completed_all_messages" = "将删除全部消息中的已完成事项。";
"message_list.logout_confirm_title" = "确认退出";
"message_list.logout_confirm_message" = "退出后需要重新登录";
"message_list.logout" = "退出";
"message_list.about" = "关于 Synca";
"message_list.feedback" = "提交反馈";
"message_list.sign_out" = "退出登录";
"message_list.session_expired_title" = "登录已过期";
"message_list.session_expired_message" = "请重新登录以继续使用";
"message_list.sign_in_again" = "重新登录";
"message_list.got_it" = "知道了";
"message_list.about_version_format" = "版本 %@ (%@)";
"message_list.about_website_hint" = "在默认浏览器中打开 Synca 网页版";
"message_list.about_message" = "\nSynca · 灵感记录，即刻同步\n\n版本 %@ (%@)\n\nhttps://synca.haerth.cn/";
"message_list.input_placeholder" = "记录此刻的想法...";
"message_list.sending_placeholder" = "正在发送...";
"message_list.manage_categories" = "分类管理";
"account.section_title" = "账号";
"account.provider.apple" = "通过 Apple 登录";
"account.email_unavailable" = "当前 Apple 账号邮箱不可用";
"account.email_hidden_title" = "邮箱已由 Apple 隐藏";
"account.email_hidden_message" = "这个账号正在使用“隐藏邮箱地址”，Synca 不会看到你的真实邮箱。";
"account.delete_action" = "删除账号";
"account.delete_confirm_title" = "删除账号";
"account.delete_confirm_message" = "这将永久删除你的 Synca 账号，并从 Synca 服务器移除已同步的消息、文件、分类、反馈和登录会话数据。此操作不可撤销。";
"account.delete_success_title" = "账号已删除";
"account.delete_success_message" = "你的 Synca 账号及相关数据已被删除。";
"account.delete_failed_title" = "无法删除账号";
"account.delete_failed_message" = "请稍后再试。";
"sync.error_context.sync" = "同步";
"sync.error_context.send" = "发送";
"sync.error_context.send_image" = "图片发送";
"sync.error_context.send_file" = "文件发送";
"sync.error_context.clear" = "清理";
"sync.error_context.delete" = "删除";
"sync.error_format" = "%@失败: %@ (Code: %d, Domain: %@)";
"sync.batch_send_partial_failure" = "批量发送完成，但有 %d 张图片发送失败";
"api.invalid_response" = "服务器响应异常";
"api.unauthorized" = "登录已过期，请重新登录";
"api.http_error" = "请求失败 (%d): %@";
"access.center_title" = "Synca 无限版";
"access.status_trial" = "试用中 · 剩余 %d 天";
"access.status_free" = "免费版 · 今日 %d/%d";
"access.status_unlimited" = "无限版";
"access.status_unlimited_badge" = "无限版";
"access.status_trial_inline" = "Trial %d天";
"access.status_free_inline" = "免费版 %d/%d";
"access.status_unlimited_inline" = "∞";
"access.status_trial_compact" = "试用 %d天";
"access.status_free_compact" = "免费 %d/%d";
"access.status_unlimited_compact" = "无限版";
"access.trial_description" = "你仍在 7 天不限量试用期内，剩余 %d 天。";
"access.free_description" = "今天已记录 %d/%d 条。";
"access.current_plan_title" = "当前套餐";
"access.current_free_summary" = "今日 %d/%d";
"access.free_daily_rule" = "每天最多新增 20 条";
"access.free_title" = "免费版";
"access.trial_rule" = "试用期内不限量记录 · 剩余 %d 天";
"access.free_rule" = "每天最多新增 %d 条消息";
"access.free_usage" = "今日使用：%d/%d";
"access.free_keep_access" = "查看、同步、清理和删除已有内容始终可用";
"access.free_reset_hint" = "免费额度会在每天自动重置";
"access.unlock_title" = "升级无限版";
"access.unlock_benefit_unlimited" = "不限新增消息数量";
"access.unlock_benefit_cross_device" = "iPhone 和 Mac 跨设备持续可用";
"access.unlock_benefit_capture_anytime" = "灵感来了随时记录，不再受限";
"access.purchase_shared_account" = "一次购买，同步解锁 iPhone 和 Mac";
"access.shared_base_feature" = "所有套餐都支持同步、图片附件和历史记录访问";
"access.shared_future_feature" = "并包含未来上线的所有高级功能";
"access.subscription_info_title" = "订阅信息";
"access.subscription_info_format" = "自动续费周期：%@，价格：%@。";
"access.billing_period_monthly" = "1 个月";
"access.billing_period_yearly" = "1 年";
"access.subscription_manage_hint" = "除非在当前订阅周期结束前至少 24 小时取消，否则订阅将自动续费。你可随时在 App Store 账户设置中管理或取消订阅。";
"access.privacy_policy_link_title" = "隐私政策";
"access.terms_link_title" = "使用条款";
"access.purchase_options_title" = "购买方式";
"access.purchase_shared_hint" = "同一账号下，所有设备均可通用。";
"access.option_monthly_title" = "无限版（月付）";
"access.option_monthly_subtitle" = "按月自动续费，可随时取消。";
"access.option_yearly_title" = "无限版（年付）";
"access.option_yearly_subtitle" = "按年自动续费，每年续费一次。";
"access.intro_free_trial_then_template" = "%@ 免费试用，之后按 %@ / %@ 自动续费，直至取消。";
"access.intro_payg_then_template" = "前 %@ 享受优惠，之后按 %@ / %@ 续费。";
"access.intro_payupfront_then_template" = "优惠价覆盖 %@，之后按 %@ / %@ 续费。";
"access.subscription_renews_template" = "%@ / %@，自动续费，直至取消。";
"access.option_lifetime_title" = "终身版";
"access.option_lifetime_subtitle" = "一次性买断，永久可用。";
"access.purchase_setup_pending" = "App Store 购买通道是下一步接入内容。";
"access.buy_for_price" = "%@ 购买";
"access.restore_purchases" = "恢复购买";
"access.purchase_fetch_failed" = "暂时无法加载 App Store 商品。";
"access.purchase_unavailable" = "当前无法发起购买，请稍后再试。";
"access.purchase_unavailable_short" = "暂不可用";
"access.purchase_failed" = "购买失败，请稍后再试。";
"access.purchase_pending" = "购买正在等待确认。";
"access.purchase_verification_failed" = "购买校验失败。";
"access.purchase_account_missing" = "需要先刷新账号状态后才能购买。";
"access.offer_unavailable" = "当前还没有可用的终身升级优惠。";
"access.lifetime_offer_copied" = "优惠码已复制，请在兑换面板中粘贴使用。";
"access.restore_success" = "已恢复此 App Store 账号下的购买记录。";
"access.restore_no_purchases" = "这个账号当前没有可恢复的购买记录。";
"access.restore_failed" = "暂时无法恢复购买。";
"access.purchased_monthly" = "无限版（月付）";
"access.purchased_yearly" = "无限版（年付）";
"access.purchased_lifetime" = "终身版";
"access.unlimited_title" = "无限版权益";
"access.unlimited_description" = "你已解锁不限量记录权益，并可在所有设备上使用。";
"access.subscription_billing_label" = "计费方式";
"access.purchase_date_label" = "购买日期";
"access.subscription_expires_label" = "下次续费";
"access.purchase_date" = "购买时间：%@";
"access.subscription_expires" = "续费 / 到期时间：%@";
"access.switch_to_yearly" = "升级到年付";
"access.switch_to_monthly" = "切换到月付";
"access.lifetime_upgrade_title" = "升级终身版";
"access.upgrade_to_lifetime" = "按原价升级终身版";
"access.upgrade_to_lifetime_offer" = "优惠升级终身版";
"access.offer_code_label" = "订阅用户专属优惠码";
"access.copy_offer_code" = "复制";
"access.offer_code_hint" = "将自动复制一次性优惠码，并在 app 内打开兑换面板。";
"access.offer_code_redeem_hint" = "点击兑换你的专属优惠，升级为终身版。";
"access.intro_offer_badge" = "首月免费";
"access.limit_reached_title" = "今日免费额度已用完";

/* Feedback */
"feedback.title" = "提交反馈";
"feedback.submit" = "发送";
"feedback.content_title" = "反馈内容";
"feedback.content_placeholder" = "请写下你的想法、建议或遇到的问题。";
"feedback.images_title" = "图片附件";
"feedback.add_images" = "添加图片";
"feedback.add_more_images" = "继续添加图片";
"feedback.images_limit" = "已添加 %d/%d 张图片";
"feedback.email_title" = "邮箱";
"feedback.email_placeholder" = "必填，方便联系反馈";
"feedback.error_content_required" = "请先填写反馈内容。";
"feedback.error_content_too_long" = "反馈内容不能超过 %d 个字符。";
"feedback.error_email_required" = "请填写有效的邮箱地址。";
"feedback.submit_failed" = "暂时无法提交反馈，请稍后再试。";
"feedback.submit_success" = "反馈已发送";

/* Message Bubble */
"message_bubble.delete_confirm_title" = "确认删除";
"message_bubble.delete_confirm_message" = "此操作将从云端永久抹除此记录%@，且不可撤销。";
"message_bubble.delete_image_suffix" = "和图片文件";
"message_bubble.load_failed_retry" = "加载失败，点击重试";
"message_bubble.open_with_preview" = "用预览打开";
"message_bubble.show_in_finder" = "在访达中显示";
"message_bubble.save_as" = "另存为...";
"message_bubble.save_failed_title" = "保存失败";
"message_bubble.save_failed_message" = "无法将图片保存到指定目录: %@\n\n极大可能是由于权限不足，您可以尝试\"另存为\"以重新授权。";
"message_bubble.choose_save_directory" = "选择保存目录";
"message_bubble.save_to_directory" = "保存到此目录";
"message_file.error_too_large" = "文件不能超过 25 MB。";
"message_file.error_image_too_large" = "图片不能超过 20 MB。";
"message_file.error_unsupported" = "暂不支持这种文件类型。";

/* Message Categories */
"message_category.section_title" = "分类";
"message_category.manage_description" = "编辑分类名称和颜色，点击保存后统一生效。";
"message_category.new_section" = "新建分类";
"message_category.name_placeholder" = "分类名称";
"message_category.color_label" = "颜色";
"message_category.name_column" = "名称";
"message_category.add_action" = "添加分类";
"message_category.save_name" = "保存名称";
"message_category.delete_action" = "删除分类";
"message_category.move_up" = "上移";
"message_category.move_down" = "下移";
"message_category.default_badge" = "默认";
"message_category.duplicate_title" = "分类已存在";
"message_category.duplicate_message" = "请换一个分类名称。";
"message_category.invalid_title" = "分类名称不能为空";
"message_category.invalid_message" = "保存前请为每个分类填写名称。";
"message_category.delete_confirm_title" = "删除分类？";
"message_category.delete_confirm_message" = "保存后这个分类会被删除。";
"message_category.color.sky" = "天蓝";
"message_category.color.mint" = "薄荷";
"message_category.color.amber" = "琥珀";
"message_category.color.coral" = "珊瑚";
"message_category.color.violet" = "紫罗兰";
"message_category.color.slate" = "岩灰";
"message_category.color.rose" = "玫瑰";
"message_category.color.ocean" = "海蓝";

/* Image Preview */
"image_preview.download_to_local" = "下载到本地";
"image_preview.saving" = "正在保存...";
"image_preview.save_success" = "保存成功";
"image_preview.save_failed" = "保存失败";
"image_preview.load_failed" = "图片加载失败";
"image_preview.tap_to_retry" = "点击重试";

"common.send" = "发送";
